backend/tests/LoadTests/results/analytics-load-20260502-224301.txt

          /\      |ΓÇ╛ΓÇ╛| /ΓÇ╛ΓÇ╛/   /ΓÇ╛ΓÇ╛/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ΓÇ╛ΓÇ╛\  
   /          \   |  |\  \ |  (ΓÇ╛)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: .\analytics-advanced-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 25s max duration (incl. graceful stop):
              * smoke: 5 looping VUs for 20s (exec: smokeSuite, gracefulStop: 5s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
smoke   [   5% ] 5 VUs  01.0s/20s

running (02.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
smoke   [  10% ] 5 VUs  02.0s/20s

running (03.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
smoke   [  15% ] 5 VUs  03.0s/20s

running (04.1s), 5/5 VUs, 15 complete and 0 interrupted iterations
smoke   [  20% ] 5 VUs  04.1s/20s

running (05.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
smoke   [  25% ] 5 VUs  05.0s/20s

running (06.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
smoke   [  30% ] 5 VUs  06.0s/20s

running (07.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
smoke   [  35% ] 5 VUs  07.0s/20s

running (08.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
smoke   [  40% ] 5 VUs  08.0s/20s

running (09.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
smoke   [  45% ] 5 VUs  09.0s/20s

running (10.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
smoke   [  50% ] 5 VUs  10.0s/20s

running (11.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
smoke   [  55% ] 5 VUs  11.0s/20s

running (12.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
smoke   [  60% ] 5 VUs  12.0s/20s

running (13.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
smoke   [  65% ] 5 VUs  13.0s/20s

running (14.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
smoke   [  70% ] 5 VUs  14.0s/20s

running (15.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
smoke   [  75% ] 5 VUs  15.0s/20s

running (16.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
smoke   [  80% ] 5 VUs  16.0s/20s

running (17.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
smoke   [  85% ] 5 VUs  17.0s/20s

running (18.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
smoke   [  90% ] 5 VUs  18.0s/20s

running (19.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
smoke   [  95% ] 5 VUs  19.0s/20s

running (20.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
smoke   [ 100% ] 5 VUs  20.0s/20s

     Γ£ô status is 200 (slo-status)

     checks.........................: 100.00% Γ£ô 100      Γ£ù 0  
     data_received..................: 37 kB   1.8 kB/s
     data_sent......................: 18 kB   882 B/s
   Γ£ô failures.......................: 0.00%   Γ£ô 0        Γ£ù 100
     http_req_blocked...............: avg=1.39ms   min=0s      med=0s    max=28.38ms p(90)=0s       p(95)=2.29ms 
     http_req_connecting............: avg=52.4┬╡s   min=0s      med=0s    max=2.06ms  p(90)=0s       p(95)=0s     
   Γ£ô http_req_duration..............: avg=5.61ms   min=985.9┬╡s med=2ms   max=39.09ms p(90)=20.54ms  p(95)=21.79ms
       { expected_response:true }...: avg=5.61ms   min=985.9┬╡s med=2ms   max=39.09ms p(90)=20.54ms  p(95)=21.79ms
   Γ£ô http_req_failed................: 0.00%   Γ£ô 0        Γ£ù 100
     http_req_receiving.............: avg=160.46┬╡s min=0s      med=0s    max=2.99ms  p(90)=993.16┬╡s p(95)=1ms    
     http_req_sending...............: avg=20.47┬╡s  min=0s      med=0s    max=1.02ms  p(90)=0s       p(95)=0s     
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s    max=0s      p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=5.43ms   min=985.9┬╡s med=2ms   max=39.09ms p(90)=18.77ms  p(95)=21.79ms
     http_reqs......................: 100     4.897064/s
     iteration_duration.............: avg=1.02s    min=1s      med=1.01s max=1.07s   p(90)=1.04s    p(95)=1.06s  
     iterations.....................: 100     4.897064/s
     vus............................: 5       min=5      max=5
     vus_max........................: 5       min=5      max=5


running (20.4s), 0/5 VUs, 100 complete and 0 interrupted iterations
smoke Γ£ô [ 100% ] 5 VUs  20s